app/controllers/sessions_controller.rb

  def create
    user = User.create_from_omniauth(request.env["omniauth.auth"])
---
INSERT INTO "users" ("username", "email", "uid", "provider", "oauth_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)