app/models/user.rb

  def self.create_from_omniauth(auth)
    where(provider: auth.provider, uid: auth.uid).first_or_initialize.tap do |user|
      user.email = auth.info.email
      user.uid = auth.uid
      user.provider = auth.provider
      user.username = auth.info.name
      user.oauth_token = auth.credentials.token
      user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "github"], ["uid", "5887719"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "uid", "provider", "oauth_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "oauth_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["oauth_token", "667f401d6efd091375799462c528e519d757af0c"], ["updated_at", "2018-04-20 08:11:01.385636"], ["id", 1]]